satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
/*****************************************************************************
* File    : @file
* Company : Yantronix
* Author  : Satish Nair
* Mailto  : satishgn77@gmail.com
*****************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "hw_config.h"

// const uint8_t Test_Image[] = { 
    // /* #include "bmp\\Test_Image_32x32.h" */
    // #include "Test_Image_128x64.h"
// };

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#ifdef USE_STM32_SGN101
  #define MESSAGE1   " STM32 High Density " 
  #define MESSAGE2   " Device running on  " 
  #define MESSAGE3   "    STM32-SGN101    " 
// #elif defined USE_STM32_XYZ
  // #define MESSAGE1   "--------------------" 
  // #define MESSAGE2   "--------------------" 
  // #define MESSAGE3   "--------------------"   
#endif

#define ADC1_DR_Address         ((uint32_t)0x4001244C)

#ifdef USE_DAC_SIGNALGEN 
#define DAC_DHR12R2_Address     ((uint32_t)0x40007414)
#endif

#define MAX_FILES   6

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
ErrorStatus HSEStartUpStatus;

FRESULT res; //FatFs function common result code 
FATFS FATFS_Obj; //Work area (file system object) for logical drives 
FIL fil_obj; //file object
BYTE fileReadBuffer[20];
UINT bytesRead;
UINT bytesWritten;
FIL DATA_LOG_FIL_Obj; //data log file object
__IO uint16_t DATA_LOG_Read_Buff[DMA_DATA_BUFF_SIZE];
UINT dataLogBytesReadHT = 0;
UINT dataLogBytesReadTC = 0;
UINT dataLogBytesWritten = DMA_DATA_BUFF_SIZE;
uint16_t DATA_LOGGING_ENABLED = 0;
uint16_t MEM_DMA_TIM_ENABLED = 0;
#ifdef LCD_DEBUG_MESSAGE
uint8_t LCD_Display_Buff[20];
#endif
  
// __IO uint16_t ADCConvertedValue;  
uint8_t Data_Channel[DATA_CHANNELS];
uint8_t Data_Channel_Trace_Enabled[DATA_CHANNELS];
uint8_t Data_Channel_Filter_Enabled[DATA_CHANNELS];
__IO uint8_t Data_Channel_Index = 0;
uint16_t ADC_Sampling_Freq = ADC_SAMPLING_FREQ_125;
__IO uint16_t DATA_Buff[DMA_DATA_BUFF_SIZE];
#ifdef USE_ADC_OVERSAMPLING    
__IO uint16_t OVS_DATA_Buff[OVS_DMA_DATA_BUFF_SIZE];
#endif
uint16_t ADC_DMA_TIM_ENABLED = 1;

uint16_t traceXPos = 1;
uint16_t traceYPos = 1;
uint16_t traceWidth = 93;
uint16_t traceHeight = 62;  
uint16_t traceBackColor = LCD_COLOR_WHITE;
uint16_t traceColor = LCD_COLOR_BLACK;

__IO uint16_t prevData[DATA_CHANNELS];    //traceYPos + traceHeight/2;
__IO uint16_t traceOffset = 1;  //traceXPos;
  
uint16_t DETECT_DISPLAY_HR_ENABLED = 0;
uint16_t QRS_Upper_Threshold = 37;                      // there is a historysis to avoid noise
uint16_t QRS_Lower_Threshold = 37;
uint16_t QRS_Detect = 0;
uint16_t QRS_Interval = 0;
uint8_t Heart_Rate = 0;
  
const uint16_t HeartSymbol_SET_9x7_Table[] = {
    /* SHL/COM Output Scan Direction: $C0 Normal COM0->COM63 */
    0x60, 0xF0, 0xF8, 0x7C, 0x3E, 0x7C, 0xF8, 0xF0, 0x60
};

const uint16_t HeartSymbol_RESET_9x7_Table[] = {
    /* SHL/COM Output Scan Direction: $C0 Normal COM0->COM63 */
    0x60, 0x90, 0x88, 0x44, 0x22, 0x44, 0x88, 0x90, 0x60
};

#ifdef USE_DAC_SIGNALGEN 
uint16_t DAC_DMA_TIM_ENABLED = 1;
const uint16_t SineFreqTable[6] = {1, 5, 10, 20, 25, 50};
uint16_t SineFreqIndex = 0; //Default 1 Hz
const uint16_t Sine12bit[DAC_NPT] = { 2047, 2447, 2831, 3185, 3498, 3750, 3939, 4056, 4095, 4056,
                                 3939, 3750, 3495, 3185, 2831, 2447, 2047, 1647, 1263, 909, 
                                 599, 344, 155, 38, 0, 38, 155, 344, 599, 909, 1263, 1647 };
#endif  
#if defined (USE_DAC_VGND) || defined (USE_DAC_IA_REF)
__IO uint16_t DAC_Channel1_Data = 2048; //Virtual Ground Half Supply
#endif
                             
static __IO uint32_t TimingDelay = 0;
   
__IO uint8_t SD_CARD_DETECTED = 1;    //SD Card Not Present
__IO uint8_t USB_HOST_DETECTED = 0;   //USB Host Not Connected
__IO uint8_t REGULATOR_FAULT_DETECTED = 1;   //Voltage Regulator OK
                             
uint32_t LCD_BackLight_RTC_Counter = 0;
#ifdef USE_IWDG                              
uint32_t IWDG_ReloadCounter_RTC_Counter = 0;                             
#endif
uint32_t System_Shutdown_RTC_Counter = 0;                             
uint32_t LowPower_StopMode_RTC_Counter = 0;
   
__IO uint8_t STOPMODE_SYSTEM_SHUTDOWN = 0;
__IO uint8_t POWERKEY_SYSTEM_SHUTDOWN = 0;
                             
/* Extern variables ----------------------------------------------------------*/
extern uint16_t FILTER_ENABLED;
extern uint16_t DRAW_LCD_TRACE_ENABLED;
extern uint16_t filter_type;
extern uint16_t scale_factor;
extern uint16_t filter_offset;

extern __IO uint8_t LOW_POWER_STOP_MODE;

/* Private function prototypes -----------------------------------------------*/
// static void RCC_Config(void);                            
                            
#ifdef USE_USB_HID                            
static void IntToUnicode (uint32_t value , uint8_t *pbuf , uint8_t len);
#endif
                            
#ifdef __GNUC__
  /* With GCC/RAISONANCE, small printf (option LD Linker->Libraries->Small printf
     set to 'Yes') calls __io_putchar() */
  #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
  #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */
                            
/* Private functions ---------------------------------------------------------*/

// /*******************************************************************************
// * Function Name  : RCC_Config
// * Description    : Configures Main system clocks & power
// * Input          : None.
// * Return         : None.
// *******************************************************************************/
// static void RCC_Config(void)
// {    
  // /* SYSCLK, HCLK, PCLK2 and PCLK1 configuration -----------------------------*/   
  // /* RCC system reset(for debug purpose) */
  // RCC_DeInit();

