satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
  // /* Enable HSE */
  // RCC_HSEConfig(RCC_HSE_ON);

  // /* Wait till HSE is ready */
  // HSEStartUpStatus = RCC_WaitForHSEStartUp();

  // if (HSEStartUpStatus == SUCCESS)
  // {
// #if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL && !defined STM32F10X_HD_VL
    // /* Enable Prefetch Buffer */
    // FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);

    // /* Flash 2 wait state */
    // /* FLASH_SetLatency(FLASH_Latency_2); */
  
    // /* Flash 0 wait state */
    // FLASH_SetLatency(FLASH_Latency_0);
// #endif /* STM32F10X_LD_VL && STM32F10X_MD_VL */

    // /* HCLK = SYSCLK */
    // RCC_HCLKConfig(RCC_SYSCLK_Div1); 
  
    // /* PCLK2 = HCLK */
    // RCC_PCLK2Config(RCC_HCLK_Div1); 

    // /* PCLK1 = HCLK/2 */
    // /* RCC_PCLK1Config(RCC_HCLK_Div2); */
 
    // /* PCLK1 = HCLK */
    // RCC_PCLK1Config(RCC_HCLK_Div1);
  
    // /* ADCCLK = PCLK2/8 */
    // /* RCC_ADCCLKConfig(RCC_PCLK2_Div8); */

// #if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
    // /* ADCCLK = PCLK2/2 */
    // RCC_ADCCLKConfig(RCC_PCLK2_Div2); 
// #else
    // /* ADCCLK = PCLK2/4 */
    // RCC_ADCCLKConfig(RCC_PCLK2_Div4); 
// #endif

// #ifdef STM32F10X_CL
    // /* Configure PLLs *********************************************************/
    // /* PLL2 configuration: PLL2CLK = (HSE / 5) * 8 = 40 MHz */
    // RCC_PREDIV2Config(RCC_PREDIV2_Div5);
    // RCC_PLL2Config(RCC_PLL2Mul_8);

    // /* Enable PLL2 */
    // RCC_PLL2Cmd(ENABLE);

    // /* Wait till PLL2 is ready */
    // while (RCC_GetFlagStatus(RCC_FLAG_PLL2RDY) == RESET)
    // {}

    // /* PLL configuration: PLLCLK = (PLL2 / 5) * 9 = 72 MHz */ 
    // /* RCC_PREDIV1Config(RCC_PREDIV1_Source_PLL2, RCC_PREDIV1_Div5); */
    // /* RCC_PLLConfig(RCC_PLLSource_PREDIV1, RCC_PLLMul_9); */
    
    // /* PLL configuration: PLLCLK = (PLL2 / 10) * 6 = 24 MHz */ 
    // RCC_PREDIV1Config(RCC_PREDIV1_Source_PLL2, RCC_PREDIV1_Div10);
    // RCC_PLLConfig(RCC_PLLSource_PREDIV1, RCC_PLLMul_6);    
// #elif defined STM32F10X_LD_VL || defined STM32F10X_MD_VL || defined STM32F10X_HD_VL 
    // /* PLLCLK = (8MHz/2) * 6 = 24 MHz */
    // RCC_PREDIV1Config(RCC_PREDIV1_Source_HSE, RCC_PREDIV1_Div2);
    // RCC_PLLConfig(RCC_PLLSource_PREDIV1, RCC_PLLMul_6);
// #elif defined (USE_STM32_PRIMER2)
    // /* PLLCLK = 12MHz * 6 = 72 MHz */
    // /* RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_6); */
    
    // /* PLLCLK = 12MHz * 2 = 24 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_2);
// #else    
    // /* PLLCLK = 8MHz * 9 = 72 MHz */
    // /* RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9); */   
    
    // /* PLLCLK = 8MHz * 3 = 24 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_3);    
// #endif

    // /* Enable PLL */ 
    // RCC_PLLCmd(ENABLE);

    // /* Wait till PLL is ready */
    // while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
    // {
    // }

    // /* Select PLL as system clock source */
    // RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);

    // /* Wait till PLL is used as system clock source */
    // while(RCC_GetSYSCLKSource() != 0x08)
    // {
    // }
  // }
  // else
  // { /* If HSE fails to start-up, the application will have wrong clock configuration.
       // User can add here some code to deal with this error */    

    // /* Go to infinite loop */
    // while (1)
    // {
    // }
  // }
// }
                            
/*******************************************************************************
* Function Name  : Set_System
* Description    : Configures Main system clocks & power.
* Input          : None.
* Return         : None.
*******************************************************************************/
void Set_System(void)
{
  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f10x_xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f10x.c file
     */     

  /* Setup the microcontroller system. Initialize the Embedded Flash Interface,  
     initialize the PLL and update the SystemFrequency variable. */
  //SystemInit();
  //RCC_Config();

  /* Configure the used GPIOs*/
  GPIO_Configuration();

  /* Configure NVIC */
  NVIC_Configuration();
  
#ifdef USE_USB_HID
  /* Configure USB Clock */
  Set_USBClock();
  
  /* Initialize USB system */
  USB_Init();
#endif

  /* Configure the EXTI lines */
  EXTI_Configuration();

  /* Configure the systick */    
  SysTick_Configuration();

  /* Initialize the LCD */
#ifdef USE_STM32_SGN101
  LCD_Init();  
// #elif defined USE_STM32_XYZ
  // LCD_Init();  
#endif

  /* Configure LCD Backlight - default no backlight */
  LCD_BackLightConfig();
  
  // LCD_SetBackLight(LCD_BRIGHTNESS_NIL);//BRIGHTNESS_NIL,BRIGHTNESS_LOW,BRIGHTNESS_MEDIUM,BRIGHTNESS_HIGH,BRIGHTNESS_FULL
  
  // LCD_Clear(LCD_COLOR_WHITE);
  // LCD_DisplayStringLine(LCD_LINE_0, MESSAGE1);
  // LCD_DisplayStringLine(LCD_LINE_1, MESSAGE2);
  // LCD_DisplayStringLine(LCD_LINE_2, MESSAGE3);
  
  // /* extern const uint8_t Test_Image[]; */
  // LCD_DisplayImage(Test_Image, 0, 0, 128, 64); /* 128x64 Image Size */
  
  // LCD_DrawRect(0, 0, LCD_WIDTH, LCD_HEIGHT, LCD_COLOR_BLACK);
  // LCD_DrawLine(0, LCD_HEIGHT/2, LCD_WIDTH, LCD_HEIGHT/2, LCD_COLOR_BLACK);
  // LCD_DrawLine(LCD_WIDTH/2, 0, LCD_WIDTH/2, LCD_HEIGHT, LCD_COLOR_BLACK);
  // LCD_DrawLine(0, 0, LCD_WIDTH/2, LCD_HEIGHT/2, LCD_COLOR_BLACK);
  // LCD_DrawLine(0, LCD_HEIGHT/2, LCD_WIDTH/2, 0, LCD_COLOR_BLACK);  
  // LCD_FillRect(5*LCD_WIDTH/8, LCD_HEIGHT/8, LCD_WIDTH/4, LCD_HEIGHT/4, LCD_COLOR_BLACK);
  // LCD_DrawCircle(3*LCD_WIDTH/4, 3*LCD_HEIGHT/4, LCD_HEIGHT/4-1, LCD_COLOR_BLACK);
  // LCD_FillCircle(3*LCD_WIDTH/4, 3*LCD_HEIGHT/4, LCD_HEIGHT/4-8, LCD_COLOR_BLACK);

  /* Clear the LCD */ 
  LCD_Clear(LCD_COLOR_WHITE);
 
  /* If HSE is not detected at program startup */
  /* if(HSEStartUpStatus == ERROR) */
  if(RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET)
  {
    /* Generate NMI exception */
    SCB->ICSR |= SCB_ICSR_NMIPENDSET;
  }

  PowerKeyIntExtOnOffConfig(ENABLE);
#ifdef REGULATOR_FAULT
  RegulatorFaultIntExtOnOffConfig(ENABLE);
#endif
#ifdef SD_CARD_DETECT
  SDCardDetectIntExtOnOffConfig(ENABLE);
#endif
#ifdef USB_HOST_DETECT
  USBHostDetectIntExtOnOffConfig(ENABLE);
#endif

#ifdef REGULATOR_FAULT
  /* Low Battery - Regulator fault detect */
  Regulator_Fault();
#endif

