satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
#ifdef USE_DAC_SIGNALGEN 
  /* Configure SIGNALGEN_AIN as analog input */
  GPIO_InitStructure.GPIO_Pin = GPIO_SIGNALGEN_AIN_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_SIGNALGEN_AIN, &GPIO_InitStructure);
#endif  

#ifdef USE_DAC_VGND  
  /* Once the DAC channel is enabled, the corresponding GPIO pin is automatically 
     connected to the DAC converter. In order to avoid parasitic consumption, 
     the GPIO pin should be configured in analog */ 
  GPIO_InitStructure.GPIO_Pin = GPIO_VGND_AOUT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_VGND_AOUT, &GPIO_InitStructure);
#endif

#ifdef USE_DAC_IA_REF  
  /* Once the DAC channel is enabled, the corresponding GPIO pin is automatically 
     connected to the DAC converter. In order to avoid parasitic consumption, 
     the GPIO pin should be configured in analog */ 
  GPIO_InitStructure.GPIO_Pin = GPIO_IA_REF_AOUT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_IA_REF_AOUT, &GPIO_InitStructure);
#endif    
 
#ifdef USE_DAC_SIGNALGEN 
  /* Once the DAC channel is enabled, the corresponding GPIO pin is automatically 
     connected to the DAC converter. In order to avoid parasitic consumption, 
     the GPIO pin should be configured in analog */
  GPIO_InitStructure.GPIO_Pin = GPIO_SIGNALGEN_AOUT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_SIGNALGEN_AOUT, &GPIO_InitStructure);
#endif  

#ifdef USE_BUZZER
  /* Configure the Buzzer IO as Output PP */
  GPIO_InitStructure.GPIO_Pin = GPIO_BUZZER_PIN ;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIO_BUZZER, &GPIO_InitStructure);
  // /* Turn on Buzzer */
  // GPIO_ResetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
  /* Turn off Buzzer */
  GPIO_SetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
#endif

#ifdef USE_LED
  /* Configure the LED1 & LED2 IOs as Output PP */
  GPIO_InitStructure.GPIO_Pin = GPIO_LED1_PIN | GPIO_LED2_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIO_LED, &GPIO_InitStructure);
  // /* Turn on LED2 */
  // GPIO_ResetBits(GPIO_LED, GPIO_LED2_PIN);
  /* Turn off LED2 */
  GPIO_SetBits(GPIO_LED, GPIO_LED2_PIN);
#endif
    
  /* Configure Shutdown Pin as output push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_SHUTDOWN_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIO_SHUTDOWN, &GPIO_InitStructure);

#ifdef USE_ANALOG_POWER_SWITCH
  /* Configure Analog Power Switch Pin as output push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_ANALOG_POWER_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIO_ANALOG_POWER, &GPIO_InitStructure);
#endif

#ifdef SD_CARD_DETECT
  /* Configure SD Card detect pin as IPU */
  GPIO_InitStructure.GPIO_Pin = GPIO_SD_CARD_DETECT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIO_SD_CARD_DETECT, &GPIO_InitStructure);
#endif

#ifdef USB_HOST_DETECT
  /* Configure USB host detect pin as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_USB_HOST_DETECT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIO_USB_HOST_DETECT, &GPIO_InitStructure);
#endif

#ifdef REGULATOR_FAULT
  /* Configure Regulator fault pin as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_REGULATOR_FAULT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIO_REGULATOR_FAULT, &GPIO_InitStructure);
#endif
}

/*******************************************************************************
* Function Name : EXTI_Configuration.
* Description   : Configure the EXTI lines.
* Input         : None.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void EXTI_Configuration()
{
  EXTI_InitTypeDef EXTI_InitStructure;
  
  /* Connect Keys/Buttons to the corresponding EXTI lines */
  GPIO_EXTILineConfig(GPIO_POWER_PORTSOURCE, GPIO_POWER_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_MENU_PORTSOURCE, GPIO_MENU_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_SEL_PORTSOURCE, GPIO_SEL_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_UP_PORTSOURCE, GPIO_UP_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_DOWN_PORTSOURCE, GPIO_DOWN_PINSOURCE);
#ifdef SD_CARD_DETECT
  GPIO_EXTILineConfig(GPIO_SD_CARD_DETECT_PORTSOURCE, GPIO_SD_CARD_DETECT_PINSOURCE);
#endif
#ifdef USB_HOST_DETECT
  GPIO_EXTILineConfig(GPIO_USB_HOST_DETECT_PORTSOURCE, GPIO_USB_HOST_DETECT_PINSOURCE);
#endif
#ifdef REGULATOR_FAULT
  GPIO_EXTILineConfig(GPIO_REGULATOR_FAULT_PORTSOURCE, GPIO_REGULATOR_FAULT_PINSOURCE);
#endif
    
  /* Enable the EXTI Line17 Interrupt - wakeup from Stop mode via RTCAlarm interrupt */ 
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Line = EXTI_Line17;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure); 
  
  // IntExtOnOffConfig(DISABLE);
  // PowerKeyIntExtOnOffConfig(DISABLE);
// #ifdef REGULATOR_FAULT
  // RegulatorFaultIntExtOnOffConfig(DISABLE);
// #endif
// #ifdef SD_CARD_DETECT
  // SDCardDetectIntExtOnOffConfig(DISABLE);
// #endif
// #ifdef USB_HOST_DETECT
  // USBHostDetectIntExtOnOffConfig(DISABLE);
// #endif
}

/*******************************************************************************
* Function Name  : IntExtOnOffConfig
* Description    : Enables or disables EXTI for the menu navigation keys :
*                  EXTI lines corresponding to "MENU", "SEL", "UP" and "DOWN".
* Input          : NewState: New state of the navigation keys. This parameter
*                  can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void IntExtOnOffConfig(FunctionalState NewState)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Initializes the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the MENU, SEL, UP & DOWN EXTI lines */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = GPIO_MENU_EXTI_Line | GPIO_SEL_EXTI_Line | GPIO_UP_EXTI_Line | GPIO_DOWN_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the MENU, SEL, UP & DOWN EXTI lines on rising edge */
  else
  {
    /* Clear the MENU, SEL, UP & DOWN EXTI lines interrupt pending bit */
    EXTI_ClearITPendingBit(GPIO_MENU_EXTI_Line | GPIO_SEL_EXTI_Line | GPIO_UP_EXTI_Line | GPIO_DOWN_EXTI_Line);
  
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = GPIO_MENU_EXTI_Line | GPIO_SEL_EXTI_Line | GPIO_UP_EXTI_Line | GPIO_DOWN_EXTI_Line;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

