satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
/*******************************************************************************
* Function Name  : PowerKeyIntExtOnOffConfig
* Description    : Enable or disable the POWER key EXTI line
* Input          : NewState: This parameter can be ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void PowerKeyIntExtOnOffConfig(FunctionalState NewState)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Initializes the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the POWER key EXTI line */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = GPIO_POWER_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the Power key EXTI line on rising edge */
  else
  {
    /* Clear the POWER key EXTI line interrupt pending bit */
    EXTI_ClearITPendingBit(GPIO_POWER_EXTI_Line);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = GPIO_POWER_EXTI_Line;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

#ifdef SD_CARD_DETECT
/*******************************************************************************
* Function Name  : SDCardDetectIntExtOnOffConfig
* Description    : Enable or disable the SD Card detect EXTI line
* Input          : NewState: This parameter can be ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void SDCardDetectIntExtOnOffConfig(FunctionalState NewState)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Initializes the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the SD Card detect EXTI line */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = GPIO_SD_CARD_DETECT_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the SD Card detect EXTI line on rising and falling edge */
  else
  {
    /* Clear the SD Card detect EXTI line interrupt pending bit */
    EXTI_ClearITPendingBit(GPIO_SD_CARD_DETECT_EXTI_Line);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = GPIO_SD_CARD_DETECT_EXTI_Line;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

uint8_t SD_Card_Detect(void)
{
    Set_LCD_BackLight_Time();
    Set_LowPower_StopMode_Time();

    SD_CARD_DETECTED = GPIO_ReadInputDataBit(GPIO_SD_CARD_DETECT, GPIO_SD_CARD_DETECT_PIN);

    if(!SD_CARD_DETECTED)
    {
        // LCD_Clear(LCD_COLOR_WHITE);

        // LCD_DisplayStringLine(LCD_LINE_0, "====================");   
        // LCD_DisplayStringLine(LCD_LINE_1, " SD Card Inserted.. ");    
        // LCD_DisplayStringLine(LCD_LINE_2, "====================");   
    }
    else
    {
        // LCD_Clear(LCD_COLOR_WHITE);

        // LCD_DisplayStringLine(LCD_LINE_0, "====================");   
        // LCD_DisplayStringLine(LCD_LINE_1, " SD Card Removed... ");    
        // LCD_DisplayStringLine(LCD_LINE_2, "====================");   
    }

    return SD_CARD_DETECTED;
}
#endif

#ifdef USB_HOST_DETECT
/*******************************************************************************
* Function Name  : USBHostDetectIntExtOnOffConfig
* Description    : Enable or disable the USB Host detect EXTI line
* Input          : NewState: This parameter can be ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void USBHostDetectIntExtOnOffConfig(FunctionalState NewState)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Initializes the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the USB Host detect EXTI line */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = GPIO_USB_HOST_DETECT_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the USB Host detect EXTI line on rising and falling edge */
  else
  {
    /* Clear the USB Host detect EXTI line interrupt pending bit */
    EXTI_ClearITPendingBit(GPIO_USB_HOST_DETECT_EXTI_Line);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = GPIO_USB_HOST_DETECT_EXTI_Line;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

uint8_t USB_Host_Detect(void)
{
    Set_LCD_BackLight_Time();
    Set_LowPower_StopMode_Time();

    USB_HOST_DETECTED = GPIO_ReadInputDataBit(GPIO_USB_HOST_DETECT, GPIO_USB_HOST_DETECT_PIN);

    if(!USB_HOST_DETECTED)
    {
        // LCD_Clear(LCD_COLOR_WHITE);

        // LCD_DisplayStringLine(LCD_LINE_0, "====================");   
        // LCD_DisplayStringLine(LCD_LINE_1, " USB Host Removed.. ");    
        // LCD_DisplayStringLine(LCD_LINE_2, "====================");   
    }
    else
    {
        // LCD_Clear(LCD_COLOR_WHITE);

        // LCD_DisplayStringLine(LCD_LINE_0, "====================");   
        // LCD_DisplayStringLine(LCD_LINE_1, " USB Host Found...  ");    
        // LCD_DisplayStringLine(LCD_LINE_2, "====================");       
    }

    return USB_HOST_DETECTED;
}
#endif

#ifdef REGULATOR_FAULT
/*******************************************************************************
* Function Name  : RegulatorFaultIntExtOnOffConfig
* Description    : Enable or disable the Regulator fault EXTI line
* Input          : NewState: This parameter can be ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void RegulatorFaultIntExtOnOffConfig(FunctionalState NewState)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Initializes the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the Regulator fault EXTI line */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = GPIO_REGULATOR_FAULT_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the Regulator fault EXTI line on falling edge */
  else
  {
    /* Clear the Regulator fault EXTI line interrupt pending bit */
    EXTI_ClearITPendingBit(GPIO_REGULATOR_FAULT_EXTI_Line);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = GPIO_REGULATOR_FAULT_EXTI_Line;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

uint8_t Regulator_Fault(void)
{
    Set_LowPower_StopMode_Time();

    REGULATOR_FAULT_DETECTED = GPIO_ReadInputDataBit(GPIO_REGULATOR_FAULT, GPIO_REGULATOR_FAULT_PIN);

