satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
    if(!REGULATOR_FAULT_DETECTED)
    {
        LCD_SetBackLight(LCD_BRIGHTNESS_NIL);
    
        // LCD_Clear(LCD_COLOR_WHITE);

        // LCD_DisplayStringLine(LCD_LINE_0, "====================");   
        // LCD_DisplayStringLine(LCD_LINE_1, "   Low Battery!!!   ");    
        // LCD_DisplayStringLine(LCD_LINE_2, "====================");   
    }

    return REGULATOR_FAULT_DETECTED;
}
#endif

// /**
  // * @brief  Configures the RTC.
  // * @param  None
  // * @retval None
  // */
// void RTC_Configuration(void)
// {
  // /* Enable PWR and BKP clocks */
  // RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

  // /* Allow access to BKP Domain */
  // PWR_BackupAccessCmd(ENABLE);

  // /* Reset Backup Domain */
  // BKP_DeInit();

  // /* Enable LSE */
  // RCC_LSEConfig(RCC_LSE_ON);
  // /* Wait till LSE is ready */
  // while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
  // {}

  // /* Select LSE as RTC Clock Source */
  // RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

  // /* Enable RTC Clock */
  // RCC_RTCCLKCmd(ENABLE);

  // /* Wait for RTC registers synchronization */
  // RTC_WaitForSynchro();

  // /* Wait until last write operation on RTC registers has finished */
  // RTC_WaitForLastTask();

  // /* Enable the RTC Second */
  // RTC_ITConfig(RTC_IT_SEC, ENABLE);

  // /* Wait until last write operation on RTC registers has finished */
  // RTC_WaitForLastTask();

  // /* Set RTC prescaler: set RTC period to 1sec */
  // RTC_SetPrescaler(32767); /* RTC period = RTCCLK/RTC_PR = (32.768 KHz)/(32767+1) */

  // /* Wait until last write operation on RTC registers has finished */
  // RTC_WaitForLastTask();
// }

/**
  * @brief  Configure a SysTick Base time to 10 ms.
  * @param  None
  * @retval None
  */
void SysTick_Configuration(void)
{
  /* Setup SysTick Timer for 10 msec interrupts  */
  if (SysTick_Config(SystemCoreClock / 100))    //1000 for 1 msec
  {
    /* Capture error */
    while (1);
  }

  // /* Configure the SysTick handler priority */
  // NVIC_SetPriority(SysTick_IRQn, 0x0);
  /* Set SysTick interrupt vector Preemption Priority to 0 & Subpriority to 2 */
  NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0,2));
}

/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length (time base 10 ms).
  * @retval None
  */
void Delay(__IO uint32_t nCount)
{
    TimingDelay = nCount;

    // /* Enable the SysTick Counter */
    // SysTick->CTRL |= SysTick_CTRL_ENABLE;

    while(TimingDelay != 0);

    // /* Disable the SysTick Counter */
    // SysTick->CTRL &= ~SysTick_CTRL_ENABLE;

    // /* Clear the SysTick Counter */
    // SysTick->VAL = (uint32_t)0x0;
}

// /**
  // * @brief  Inserts a delay time while no joystick MENU, UP, DOWN and SEL are pressed.
  // * @param  nTount: specifies the delay time length (time base 10 ms).
  // * @retval Pressed Key. This value can be: NOKEY, MENU, UP, DOWN and SEL.
  // */
// uint32_t DelayJoyStick(__IO uint32_t nTime)
// {
  // __IO uint32_t keystate = 0;

  // TimingDelay = nTime;

  // /* Enable the SysTick Counter */
  // SysTick->CTRL |= SysTick_CTRL_ENABLE;

  // while ((TimingDelay != 0) && (keystate != MENU) && (keystate != UP) && (keystate != DOWN) && (keystate != SEL))
  // {
    // keystate = Menu_ReadKey();
  // }

  // /* Disable the SysTick Counter */
  // SysTick->CTRL &= ~SysTick_CTRL_ENABLE;

  // /* Clear the SysTick Counter */
  // SysTick->VAL = (uint32_t)0x0;

  // return keystate;
// }

/**
  * @brief  Decrements the TimingDelay variable.
  * @param  None
  * @retval None
  */
void Decrement_TimingDelay(void)
{
  if (TimingDelay != 0x00)
  {
    TimingDelay--;
  }
}

void ADC_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        ADC_InitTypeDef ADC_InitStructure;
     
        /* ADCCLK = PCLK2/4 */
        RCC_ADCCLKConfig(RCC_PCLK2_Div4); 
    
        /* Enable ADC1 clock */
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
     
        /* ADC1 configuration */
        ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
        ADC_InitStructure.ADC_ScanConvMode = DISABLE;
        ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
        ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
        ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
        ADC_InitStructure.ADC_NbrOfChannel = 1;
        ADC_Init(ADC1, &ADC_InitStructure);

        // /* ADC1 regular channel configuration */ 
        // ADC_RegularChannelConfig(ADC1, VBAT_AIN_CHANNEL, 1, ADC_SampleTime_55Cycles5);
    
        // /* Enable ADC1 EOC interupt */
        // ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);

        /* Enable ADC1 */
        ADC_Cmd(ADC1, ENABLE);

        /* Enable ADC1 reset calibaration register */   
        ADC_ResetCalibration(ADC1);
        
        /* Check the end of ADC1 reset calibration register */
        while(ADC_GetResetCalibrationStatus(ADC1));

        /* Start ADC1 calibaration */
        ADC_StartCalibration(ADC1);

        /* Check the end of ADC1 calibration */
        while(ADC_GetCalibrationStatus(ADC1));
            
        // /* Start ADC1 Software Conversion */ 
        // ADC_SoftwareStartConvCmd(ADC1, ENABLE);        
    }
    else
    {
        /* Disable ADC1 */
        ADC_Cmd(ADC1, DISABLE);

        // /* Disable ADC1 EOC interupt */
        // ADC_ITConfig(ADC1, ADC_IT_EOC, DISABLE);

        /* Disable ADC1 clock */
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, DISABLE);    
    }
}

/*******************************************************************************
* Function Name : ADC_DMA_TIM_Configuration.
* Description   : Configure the ADC and DMA.
* Input         : NewState: new state.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void ADC_DMA_TIM_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        ADC_InitTypeDef ADC_InitStructure;
        DMA_InitTypeDef DMA_InitStructure;

