satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
        uint16_t TIM3_Prescaler = 0;
        uint16_t TIM3_Autoreload = 0;

        // /* Commented since ADC sampling rate is determined by TIM3 */
// #if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL)
        // /* ADCCLK = PCLK2/2 */
        // RCC_ADCCLKConfig(RCC_PCLK2_Div2); 
// #else
        // /* ADCCLK = PCLK2/6 */
        // RCC_ADCCLKConfig(RCC_PCLK2_Div6); 
// #endif
        
        /* Enable DMA1 clock */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

        /* Enable ADC1 clock */
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

        /* Enable TIM3 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

        /* TIM3 Configuration */
        /* ADC Sampling Frequency = 72000000/7200/80 = 125Hz */
        /* ADC Sampling Frequency = 72000000/7200/40 = 250Hz */
        /* ADC Sampling Frequency = 72000000/7200/20 = 500Hz */
        /* ADC Sampling Frequency = 72000000/7200/10 = 1000Hz */
        /* TIM3_Prescaler: 7199 */
        /* TIM3_Autoreload: 79->125Hz, 39->250Hz, 19->500Hz, 9->1000Hz */
        /* ADC OverSampling Frequency(for 3 additional bits) = 72000000/45/200 = 64*125Hz = 8000Hz */
        /* ADC OverSampling Frequency(for 3 additional bits) = 72000000/45/100 = 64*250Hz = 16000Hz */
        /* ADC OverSampling Frequency(for 3 additional bits) = 72000000/45/50 = 64*500Hz = 32000Hz */
        /* ADC OverSampling Frequency(for 3 additional bits) = 72000000/45/25 = 64*1000Hz = 64000Hz */
        /* TIM3_Prescaler: 44 */
        /* TIM3_Autoreload: 199->8KHz, 99->16KHz, 49->32KHz, 24->64KHz */ 
#ifdef USE_ADC_OVERSAMPLING            
        TIM3_Prescaler = 0;
        TIM3_Autoreload = (SystemCoreClock / (ADC_OVERSAMPLING_FACTOR * ADC_Sampling_Freq)) - 1;        
#else
        TIM3_Prescaler = (SystemCoreClock / 10000) - 1;
        TIM3_Autoreload = (10000 / ADC_Sampling_Freq) - 1;      
#endif            
        TIM_PrescalerConfig(TIM3, TIM3_Prescaler, TIM_PSCReloadMode_Update);
        TIM_SetAutoreload(TIM3, TIM3_Autoreload);

        /* TIM3 TRGO selection */
        TIM_SelectOutputTrigger(TIM3, TIM_TRGOSource_Update);

        /* DMA1 channel1 configuration ---------------------------------------------*/
        DMA_DeInit(DMA1_Channel1);
        DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address;
#ifdef USE_ADC_OVERSAMPLING
        DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&OVS_DATA_Buff[0];
        DMA_InitStructure.DMA_BufferSize = OVS_DMA_DATA_BUFF_SIZE;
#else
        DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&DATA_Buff[0];
        DMA_InitStructure.DMA_BufferSize = DMA_DATA_BUFF_SIZE;  
#endif
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
        DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
        DMA_InitStructure.DMA_Priority = DMA_Priority_High;
        DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
        DMA_Init(DMA1_Channel1, &DMA_InitStructure);

        /* Enable the DMA1 Channel1 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel1, DMA_IT_HT | DMA_IT_TC, ENABLE);

        /* Clear the DMA1 Channel1 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT1 | DMA1_FLAG_TC1);

        /* Enable DMA1 channel1 */
        DMA_Cmd(DMA1_Channel1, ENABLE);

        /* ADC1 configuration ------------------------------------------------------*/
        ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
        ADC_InitStructure.ADC_ScanConvMode = ENABLE;
        ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
        ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T3_TRGO;
        ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
        ADC_InitStructure.ADC_NbrOfChannel = DATA_CHANNELS;
        ADC_Init(ADC1, &ADC_InitStructure);

        /* ADC1 regular channels configuration */ 
        for(Data_Channel_Index = 0; Data_Channel_Index < DATA_CHANNELS; Data_Channel_Index++)
        {
            ADC_RegularChannelConfig(ADC1, Data_Channel[Data_Channel_Index], Data_Channel_Index + 1, ADC_SampleTime_1Cycles5);
#ifdef USE_ADC_ANALOGWATCHDOG
            if(Data_Channel[Data_Channel_Index] == VBAT_AIN_CHANNEL)
            {
                /* Configure high and low analog watchdog thresholds */
                ADC_AnalogWatchdogThresholdsConfig(ADC1, ANALOGWATCHDOG_HIGH_THRESHOLD, ANALOGWATCHDOG_LOW_THRESHOLD);
                /* Configure VBAT_AIN_CHANNEL as the single analog watchdog guarded channel */
                ADC_AnalogWatchdogSingleChannelConfig(ADC1, VBAT_AIN_CHANNEL);
                /* Enable analog watchdog on one regular channel */
                ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_SingleRegEnable);

                /* Enable ADC1 AWD interupt */
                ADC_ITConfig(ADC1, ADC_IT_AWD, ENABLE);
            }
#endif        
        }

        /* Enable ADC1 DMA */
        ADC_DMACmd(ADC1, ENABLE);

        /* Enable ADC1 external trigger */
        ADC_ExternalTrigConvCmd(ADC1, ENABLE);

        /* Enable ADC1 */
        ADC_Cmd(ADC1, ENABLE);

        /* Enable ADC1 reset calibaration register */   
        ADC_ResetCalibration(ADC1);
        
        /* Check the end of ADC1 reset calibration register */
        while(ADC_GetResetCalibrationStatus(ADC1));

        /* Start ADC1 calibaration */
        ADC_StartCalibration(ADC1);

        /* Check the end of ADC1 calibration */
        while(ADC_GetCalibrationStatus(ADC1));  

        /* TIM3 enable counter */
        TIM_Cmd(TIM3, ENABLE);
    }
    else
    {
        /* TIM3 disable counter */
        TIM_Cmd(TIM3, DISABLE);

        /* Disable ADC1 */
        ADC_Cmd(ADC1, DISABLE);

        /* Disable ADC1 external trigger */
        ADC_ExternalTrigConvCmd(ADC1, DISABLE);

        /* Disable ADC1 DMA */
        ADC_DMACmd(ADC1, DISABLE);

