satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
        /* Disable DMA1 channel1 */
        DMA_Cmd(DMA1_Channel1, DISABLE);

        /* Disable the DMA1 Channel1 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel1, DMA_IT_HT | DMA_IT_TC, DISABLE);
    
        /* Clear the DMA1 Channel1 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT1 | DMA1_FLAG_TC1);    

        /* Disable TIM3 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, DISABLE);

        /* Disable ADC1 clock */
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, DISABLE);

        /* Disable DMA1 clock */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, DISABLE);    
    }
}

/*******************************************************************************
* Function Name : MEM_DMA_TIM_Configuration.
* Description   : Configure the TIM and DMA for playing Data log file from SDCard
* Input         : NewState: new state.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void MEM_DMA_TIM_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {  
        DMA_InitTypeDef DMA_InitStructure;

        uint16_t TIM4_Prescaler = 0;
        uint16_t TIM4_Autoreload = 0;
    
        /* Enable DMA1 clock */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

        /* Enable TIM4 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

        /* TIM4 Configuration */
        /* TIM4 Update Frequency = 72000000/7200/80 = 125Hz */
        /* TIM4 Update Frequency = 72000000/7200/40 = 250Hz */
        /* TIM4 Update Frequency = 72000000/7200/20 = 500Hz */
        /* TIM4 Update Frequency = 72000000/7200/10 = 1000Hz */
        /* TIM4_Prescaler: 7199 */
        /* TIM4_Autoreload: 79->125Hz, 39->250Hz, 19->500Hz, 9->1000Hz */
        /* Time base configuration */
        // TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
        // TIM_TimeBaseStructInit(&TIM_TimeBaseStructure); 
        // TIM_TimeBaseStructure.TIM_Prescaler = TIM4_Prescaler;       
        // TIM_TimeBaseStructure.TIM_Period = TIM4_Autoreload;          
        // TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;    
        // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  
        // TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure); 
        TIM4_Prescaler = (SystemCoreClock / 10000) - 1;
        TIM4_Autoreload = (10000 / (ADC_Sampling_Freq * DATA_CHANNELS)) - 1;
        TIM_PrescalerConfig(TIM4, TIM4_Prescaler, TIM_PSCReloadMode_Update);
        TIM_SetAutoreload(TIM4, TIM4_Autoreload);

        /* DMA1 channel7 configuration ---------------------------------------------*/
        DMA_DeInit(DMA1_Channel7);
        DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&DATA_LOG_Read_Buff[0];
        DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&DATA_Buff[0];
        DMA_InitStructure.DMA_BufferSize = DMA_DATA_BUFF_SIZE;
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
        DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
        DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
        DMA_InitStructure.DMA_Priority = DMA_Priority_High;
        DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
        DMA_Init(DMA1_Channel7, &DMA_InitStructure);

        /* Enable the DMA1 Channel7 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel7, DMA_IT_HT | DMA_IT_TC, ENABLE);

        /* Clear the DMA1 Channel7 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT7 | DMA1_FLAG_TC7);

        /* Enable DMA1 channel7 */
        DMA_Cmd(DMA1_Channel7, ENABLE);

        /* TIM4 Update DMA Request enable */
        TIM_DMACmd(TIM4, TIM_DMA_Update, ENABLE);

        /* TIM4 enable counter */
        TIM_Cmd(TIM4, ENABLE);
    }
    else
    {
        /* TIM4 disable counter */
        TIM_Cmd(TIM4, DISABLE);

        /* TIM4 Update DMA Request disable */
        TIM_DMACmd(TIM4, TIM_DMA_Update, DISABLE);

        /* Disable DMA1 channel7 */
        DMA_Cmd(DMA1_Channel7, DISABLE);

        /* Disable the DMA1 Channel7 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel7, DMA_IT_HT | DMA_IT_TC, DISABLE);

        /* Clear the DMA1 Channel7 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT7 | DMA1_FLAG_TC7);

        /* Disable TIM4 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, DISABLE);

        // /* Disable DMA1 clock */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, DISABLE);  
    }
}

#if defined (USE_DAC_VGND) || defined (USE_DAC_IA_REF)
void DAC_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        DAC_InitTypeDef DAC_InitStructure;
    
        /* DAC Periph clock enable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

        DAC_InitStructure.DAC_Trigger = DAC_Trigger_None;
        DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
        DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;   //DAC_OutputBuffer_Disable;
#ifdef USE_DAC_VGND      
        DAC_Init(VGND_AOUT_CHANNEL, &DAC_InitStructure);
#endif
#ifdef USE_DAC_IA_REF      
        DAC_Init(IA_REF_AOUT_CHANNEL, &DAC_InitStructure);
#endif
        DAC_SetChannel1Data(DAC_Align_12b_R, DAC_Channel1_Data);
        
        /* Enable DAC Channel1: Once the DAC channel1 is enabled, PA.04 is 
         automatically connected to the DAC converter. */    
#ifdef USE_DAC_VGND      
        DAC_Cmd(VGND_AOUT_CHANNEL, ENABLE);  
#endif
#ifdef USE_DAC_IA_REF      
        DAC_Cmd(IA_REF_AOUT_CHANNEL, ENABLE);  
#endif
    }
    else
    {
        /* Disable DAC Channel1 */
#ifdef USE_DAC_VGND      
        DAC_Cmd(VGND_AOUT_CHANNEL, DISABLE);  
#endif
#ifdef USE_DAC_IA_REF      
        DAC_Cmd(IA_REF_AOUT_CHANNEL, DISABLE);  
#endif
        
        /* DAC Periph clock disable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, DISABLE);    
    }
}
#endif

