satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
#ifdef USE_DAC_SIGNALGEN 
/*******************************************************************************
* Function Name : DAC_DMA_TIM_Configuration.
* Description   : Configure the DAC to generate Sine wave.
* Input         : NewState: new state.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void DAC_DMA_TIM_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        DAC_InitTypeDef DAC_InitStructure;
        DMA_InitTypeDef DMA_InitStructure;

        uint16_t TIM7_Prescaler = 0;
        uint16_t TIM7_Autoreload = 0;
    
#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* DMA2 clock enable */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
#else
        /* DMA1 clock enable */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif

        /* DAC Periph clock enable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

        /* TIM7 Periph clock enable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);

        /* TIM7 Configuration */
        /* Sine Wave Frequency/Sample Rate = 72000000/3750/150/128 = 1 Hz */
        /* TIM7_Prescaler: 3749 */
        /* TIM7_Autoreload: 149->1Hz, 0->150Hz */
        TIM7_Prescaler = (SystemCoreClock / DAC_NPT / 1000) - 1;
        TIM7_Autoreload = (1000 / SineFreqTable[SineFreqIndex]) - 1;        
        TIM_PrescalerConfig(TIM7, TIM7_Prescaler, TIM_PSCReloadMode_Update);
        TIM_SetAutoreload(TIM7, TIM7_Autoreload);

        /* TIM7 TRGO selection */
        TIM_SelectOutputTrigger(TIM7, TIM_TRGOSource_Update);

#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* DMA2 channel4 configuration */
        DMA_DeInit(DMA2_Channel4);
#else
        /* DMA1 channel4 configuration */
        DMA_DeInit(DMA1_Channel4);
#endif
        DMA_InitStructure.DMA_PeripheralBaseAddr = DAC_DHR12R2_Address;
        DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&Sine12bit;
        DMA_InitStructure.DMA_BufferSize = DAC_NPT;
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
        DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
        DMA_InitStructure.DMA_Priority = DMA_Priority_High;
        DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        DMA_Init(DMA2_Channel4, &DMA_InitStructure);
#else
        DMA_Init(DMA1_Channel4, &DMA_InitStructure);
#endif

#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* Enable DMA2 Channel4 */
        DMA_Cmd(DMA2_Channel4, ENABLE);
#else
        /* Enable DMA1 Channel4 */
        DMA_Cmd(DMA1_Channel4, ENABLE);
#endif

        /* DAC channel2 Configuration */
        DAC_InitStructure.DAC_Trigger = DAC_Trigger_T7_TRGO;
        DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
        DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable; //DAC_OutputBuffer_Disable;
        DAC_Init(SIGNALGEN_AOUT_CHANNEL, &DAC_InitStructure);

        /* Enable DAC Channel2: Once the DAC channel2 is enabled, PA.05 is 
        automatically connected to the DAC converter. */
        DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);

        /* Enable DMA for DAC Channel2 */
        DAC_DMACmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);

        /* TIM7 enable counter */
        TIM_Cmd(TIM7, ENABLE);
    }
    else
    {
        /* TIM7 disable counter */
        TIM_Cmd(TIM7, DISABLE);

        /* Disable DMA for DAC Channel2 */
        DAC_DMACmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);

        /* Disable DAC Channel2 */
        DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);

#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* Disable DMA2 Channel4 */
        DMA_Cmd(DMA2_Channel4, DISABLE);
#else
        /* Disable DMA1 Channel4 */
        DMA_Cmd(DMA1_Channel4, DISABLE);
#endif

        /* TIM7 Periph clock disable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, DISABLE);

        /* DAC Periph clock disable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, DISABLE);

// #if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        // /* DMA2 clock disable */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, DISABLE);
// #else
        // /* DMA1 clock disable */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, DISABLE);
// #endif
    }
}
#endif

/*******************************************************************************
* Function Name  : System_Shutdown.
* Description    : Shutdown system.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void System_Shutdown(void)
{
    LCD_Clear(LCD_COLOR_WHITE);

    LCD_DisplayStringLine(LCD_LINE_0, "====================");   
    LCD_DisplayStringLine(LCD_LINE_1, "  Shutting down...  ");    
    LCD_DisplayStringLine(LCD_LINE_2, "====================");   

    Set_LCD_BackLight_Time();

    Delay(100);//Delay 1 sec

    /* Unmount SDcard filesystem before shutting down */
    f_mount(0, NULL);   //unregister work area

    // GPIO_WriteBit(GPIO_SHUTDOWN, GPIO_SHUTDOWN_PIN, Bit_SET);
    GPIO_SetBits(GPIO_SHUTDOWN, GPIO_SHUTDOWN_PIN);
}

#ifdef USE_ANALOG_POWER_SWITCH
/*******************************************************************************
* Function Name : Analog_Power.
* Description   : Enable/Disable power for analog circuits(IA, OpAmps etc.).
* Input         : NewState: new state.
* Output        : None.
* Return value  : None.
*******************************************************************************/
void Analog_Power(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        // GPIO_WriteBit(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN, Bit_SET);
        GPIO_SetBits(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN);
    }
    else
    {
        // GPIO_WriteBit(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN, Bit_RESET);
        GPIO_ResetBits(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN);    
    }
}
#endif

#ifdef USE_IWDG 
void Enable_IWDG(void)
{
    /* IWDG timeout equal to 20 sec (the timeout may varies due to LSI frequency dispersion) */
    /* Enable write access to IWDG_PR and IWDG_RLR registers */
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

    /* IWDG counter clock: 40KHz(LSI) / 256 = 156.25 Hz */
    IWDG_SetPrescaler(IWDG_Prescaler_256);

    /* Set counter reload value to 3124 */
    IWDG_SetReload(3124);

