satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
    /* Reload IWDG counter */
    // IWDG_ReloadCounter();
    Set_IWDG_ReloadCounter_Time();  //Reload IWDG Counter every 10 secs

    /* Enable IWDG (the LSI oscillator will be enabled by hardware) */
    IWDG_Enable();
}
#endif

#ifdef USE_USB_HID
// /*******************************************************************************
// * Function Name  : Get_SerialNum.
// * Description    : Create the serial number string descriptor.
// * Input          : None.
// * Output         : None.
// * Return         : None.
// *******************************************************************************/
// void Get_SerialNum(void)
// {
  // uint32_t Device_Serial0, Device_Serial1, Device_Serial2;
  
  // Device_Serial0 = *(uint32_t*)(0x1FFFF7E8);
  // Device_Serial1 = *(uint32_t*)(0x1FFFF7EC);
  // Device_Serial2 = *(uint32_t*)(0x1FFFF7F0);
  
  // if(Device_Serial0 != 0)
  // {
     // CustomHID_StringSerial[2] = (uint8_t)(Device_Serial0 & 0x000000FF);  
     // CustomHID_StringSerial[4] = (uint8_t)((Device_Serial0 & 0x0000FF00) >> 8);
     // CustomHID_StringSerial[6] = (uint8_t)((Device_Serial0 & 0x00FF0000) >> 16);
     // CustomHID_StringSerial[8] = (uint8_t)((Device_Serial0 & 0xFF000000) >> 24);  
     
     // CustomHID_StringSerial[10] = (uint8_t)(Device_Serial1 & 0x000000FF);  
     // CustomHID_StringSerial[12] = (uint8_t)((Device_Serial1 & 0x0000FF00) >> 8);
     // CustomHID_StringSerial[14] = (uint8_t)((Device_Serial1 & 0x00FF0000) >> 16);
     // CustomHID_StringSerial[16] = (uint8_t)((Device_Serial1 & 0xFF000000) >> 24); 
     
     // CustomHID_StringSerial[18] = (uint8_t)(Device_Serial2 & 0x000000FF);  
     // CustomHID_StringSerial[20] = (uint8_t)((Device_Serial2 & 0x0000FF00) >> 8);
     // CustomHID_StringSerial[22] = (uint8_t)((Device_Serial2 & 0x00FF0000) >> 16);
     // CustomHID_StringSerial[24] = (uint8_t)((Device_Serial2 & 0xFF000000) >> 24); 
  // }   
// }

/*******************************************************************************
* Function Name  : Get_SerialNum.
* Description    : Create the serial number string descriptor.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Get_SerialNum(void)
{
  uint32_t Device_Serial0, Device_Serial1, Device_Serial2;

  Device_Serial0 = *(__IO uint32_t*)(0x1FFFF7E8);
  Device_Serial1 = *(__IO uint32_t*)(0x1FFFF7EC);
  Device_Serial2 = *(__IO uint32_t*)(0x1FFFF7F0);

  Device_Serial0 += Device_Serial2;

  if (Device_Serial0 != 0)
  {
    IntToUnicode (Device_Serial0, &CustomHID_StringSerial[2] , 8);
    IntToUnicode (Device_Serial1, &CustomHID_StringSerial[18], 4);
  }
}

/*******************************************************************************
* Function Name  : HexToChar.
* Description    : Convert Hex 32Bits value into char.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
static void IntToUnicode (uint32_t value , uint8_t *pbuf , uint8_t len)
{
  uint8_t idx = 0;
  
  for( idx = 0 ; idx < len ; idx ++)
  {
    if( ((value >> 28)) < 0xA )
    {
      pbuf[ 2* idx] = (value >> 28) + '0';
    }
    else
    {
      pbuf[2* idx] = (value >> 28) + 'A' - 10; 
    }
    
    value = value << 4;
    
    pbuf[ 2* idx + 1] = 0;
  }
}

#ifdef STM32F10X_CL
/*******************************************************************************
* Function Name  : USB_OTG_BSP_uDelay.
* Description    : provide delay (usec).
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void USB_OTG_BSP_uDelay (const uint32_t usec)
{
  RCC_ClocksTypeDef  RCC_Clocks;  

  /* Configure HCLK clock as SysTick clock source */
  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);
  
  RCC_GetClocksFreq(&RCC_Clocks);
  
  SysTick_Config(usec * (RCC_Clocks.HCLK_Frequency / 1000000));  
  
  SysTick->CTRL  &= ~SysTick_CTRL_TICKINT_Msk ;
  
  while (!(SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk));
}
#endif
#endif

#ifdef USE_USB_DFU
void DFU_Start(void)
{
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        

    IntExtOnOffConfig(DISABLE);

    while(Menu_ReadKey() != NOKEY)
    {
    } 

    // LCD_DisplayStringLine(LCD_LINE_3, "        STM32       ");
    // LCD_DisplayStringLine(LCD_LINE_4, "  Firmware Upgrade  ");

    BKP_WriteBackupRegister(BKP_DR10, 0xFFFF);
#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif
    NVIC_SystemReset();
}
#endif

#ifdef USE_USB_MSD
void MSD_Start(void)
{
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        

    IntExtOnOffConfig(DISABLE);

    while(Menu_ReadKey() != NOKEY)
    {
    } 

    // LCD_DisplayStringLine(LCD_LINE_3, "        STM32       ");
    // LCD_DisplayStringLine(LCD_LINE_4, "  USB Mass Storage  ");

    BKP_WriteBackupRegister(BKP_DR10, 0x5000);
#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif
    NVIC_SystemReset();
}
#endif

#ifdef USE_USB_VCP
void VCP_Start(void)
{
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        

    IntExtOnOffConfig(DISABLE);

    while(Menu_ReadKey() != NOKEY)
    {
    } 

    // LCD_DisplayStringLine(LCD_LINE_3, "        STM32       ");
    // LCD_DisplayStringLine(LCD_LINE_4, "   USB Virtual Com  ");

    BKP_WriteBackupRegister(BKP_DR10, 0x9000);
#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif
    NVIC_SystemReset();
}
#endif

void Test_FatFs(void)
{
  /* Clear LCD */
  LCD_Clear(LCD_COLOR_WHITE);        

  // /* Display text */
  // LCD_DisplayStringLine(LCD_LINE_0, "====================");
  // LCD_DisplayStringLine(LCD_LINE_1, " SDCard FatFs-R0.08 ");
  // LCD_DisplayStringLine(LCD_LINE_2, "===================="); 

  // disk_initialize(0); //initialize the disk hardware
  // /* mount filesystem, store in the instance you just made */
  // f_mount(0, &FATFS_Obj); 

  /* open file with write permission */
  res = f_open(&fil_obj, "log.txt", FA_CREATE_ALWAYS | FA_WRITE | FA_READ); 
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_0, "Open log.txt:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_0, "Open log.txt:Failed "); 
  
  // /* write text to file */
  // res = f_printf(&fil_obj, "%s\n%s\n%s\n", MESSAGE1, MESSAGE2, MESSAGE3); 
  // if(res != EOF)
    // LCD_DisplayStringLine(LCD_LINE_X, "       Success       "); 
  // else
    // LCD_DisplayStringLine(LCD_LINE_X, "       Failed        "); 

  /* write to file */
  res = f_write(&fil_obj, MESSAGE1, strlen(MESSAGE1), &bytesWritten);
  // res = f_sync(&fil_obj);
  res = f_write(&fil_obj, MESSAGE2, strlen(MESSAGE2), &bytesWritten);
  // res = f_sync(&fil_obj);
  res = f_write(&fil_obj, MESSAGE3, strlen(MESSAGE3), &bytesWritten);
  // res = f_sync(&fil_obj);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_1, "File Logging:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_1, "File Logging:Failed "); 

