satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
  /* move to top of the file */
  res = f_lseek(&fil_obj, 0);
  // if(res == FR_OK)
    // LCD_DisplayStringLine(LCD_LINE_X, "Seek from 0 :Success"); 
  // else
    // LCD_DisplayStringLine(LCD_LINE_X, "Seek from 0 :Failed "); 
  
  /* read file */
  res = f_read(&fil_obj, fileReadBuffer, sizeof(fileReadBuffer), &bytesRead);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_2, fileReadBuffer); 
  else
    LCD_DisplayStringLine(LCD_LINE_2, "File Reading:Failed "); 

  res = f_read(&fil_obj, fileReadBuffer, sizeof(fileReadBuffer), &bytesRead);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_3, fileReadBuffer); 
  else
    LCD_DisplayStringLine(LCD_LINE_3, "File Reading:Failed "); 

  res = f_read(&fil_obj, fileReadBuffer, sizeof(fileReadBuffer), &bytesRead);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_4, fileReadBuffer); 
  else
    LCD_DisplayStringLine(LCD_LINE_4, "File Reading:Failed "); 
  
  /* close the file, writes cached content to disk */
  res = f_close(&fil_obj);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_5, "File Closing:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_5, "File Closing:Failed "); 
  
  res = f_unlink("stm32_logs");  
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_6, "Dir Deleting:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_6, "Dir Deleting:Failed "); 

  res = f_mkdir("stm32_logs");  
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_7, "Dir Creating:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_7, "Dir Creating:Failed "); 
  
  // /* unregister work area */
  // f_mount(0, NULL); 
}

/**
  * @brief  Retargets the C library printf function to the USART or USB.
  * @param  None
  * @retval None
  */
PUTCHAR_PROTOTYPE
{
  //Do nothing for now
  return ch;
}

// /*-----------------------------------------------------------------------*/
// /* Get current time                                                      */
// /*-----------------------------------------------------------------------*/
// DWORD get_fattime ()
// {
	// return	((2008UL-1980) << 25)	      // Year = 2008
			// | (4UL << 21)	      // Month = April
			// | (18L << 16)	      // Day = 18
			// | (16U << 11)	      // Hour = 16
			// | (30U << 5)	      // Min = 30
			// | (0U >> 1)	      // Sec = 0
			// ;
// }

#ifdef USE_DAC_SIGNALGEN 
void Start_SIGNALGEN_Data_Acquisition(void)
{
    char TraceMenu[5][6] = {"+Freq","-Freq","PAUSE","IIROF","EXIT "};
    int TraceMenuItems = 5, TraceMenuItemIndex = 0, MyKey = 0;

    uint8_t dataLogFileName[_MAX_LFN - 1];    //Year(4)+Month(2)+Day(2)+Hour(2)+Min(2)+Sec(2)+Ext(4)+NULL(1)

    /* ADC Configuration */
    Data_Channel[0] = VBAT_AIN_CHANNEL;
    Data_Channel_Trace_Enabled[0] = 0;
    Data_Channel_Filter_Enabled[0] = 0;
    prevData[0] = 0;

    Data_Channel[DATA_CHANNELS - 1] = SIGNALGEN_AIN_CHANNEL;
    Data_Channel_Trace_Enabled[DATA_CHANNELS - 1] = 1;
    Data_Channel_Filter_Enabled[DATA_CHANNELS - 1] = 1;
    prevData[DATA_CHANNELS - 1] = traceYPos + traceHeight/2;

    traceOffset = traceXPos;

    xv[0] = xv[1] = xv[2] = xv[3] = xv[4] = 0;
    yv[0] = yv[1] = yv[2] = yv[3] = yv[4] = 0;

/*
    xv_bp1[0] = xv_bp1[1] = xv_bp1[2] = 0;
    yv_bp1[0] = yv_bp1[1] = yv_bp1[2] = 0;
    xv_bp2[0] = xv_bp2[1] = xv_bp2[2] = 0;
    yv_bp2[0] = yv_bp2[1] = yv_bp2[2] = 0;
    xv_bp3[0] = xv_bp3[1] = xv_bp3[2] = 0;
    yv_bp3[0] = yv_bp3[1] = yv_bp3[2] = 0;
    xv_bp4[0] = xv_bp4[1] = xv_bp4[2] = 0;
    yv_bp4[0] = yv_bp4[1] = yv_bp4[2] = 0;
    xv_bp5[0] = xv_bp5[1] = xv_bp5[2] = 0;
    yv_bp5[0] = yv_bp5[1] = yv_bp5[2] = 0;
    xv_bp6[0] = xv_bp6[1] = xv_bp6[2] = 0;
    yv_bp6[0] = yv_bp6[1] = yv_bp6[2] = 0;
*/

    filter_type = 1;
    scale_factor = 1;
#ifdef USE_ADC_OVERSAMPLING
    filter_offset = 16384;
#else
    filter_offset = 2048;
#endif

    /* Feature Flags */
    DRAW_LCD_TRACE_ENABLED = 1;
    ADC_DMA_TIM_ENABLED = 0;
    DAC_DMA_TIM_ENABLED = 0;
    FILTER_ENABLED = 1;
    DATA_LOGGING_ENABLED = 0;

    DETECT_DISPLAY_HR_ENABLED = 0;

    /* Disable the JoyStick interrupts */
    IntExtOnOffConfig(DISABLE);
    
    /* Clear the LCD */
    LCD_Clear(LCD_COLOR_WHITE);

    if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5)
    {
        LCD_DisplayStringLine(LCD_LINE_5, "Please Configure    ");
        LCD_DisplayStringLine(LCD_LINE_6, "Time and Date       ");
        LCD_DisplayStringLine(LCD_LINE_7, "Exit: Press Any Key ");

        while (Menu_ReadKey() == NOKEY)
        {
        }

        /* Display Main Menu */
        Menu_ReturnMainMenu();
        // /* Clear the LCD */
        // LCD_Clear(LCD_COLOR_WHITE);
        // /* Display the menu */
        // Menu_DisplayMenu();
        /* Enable the JoyStick interrupts */
        IntExtOnOffConfig(ENABLE);
        return;
    }

    LCD_DrawRect(traceXPos-1, traceYPos-1, LCD_WIDTH, LCD_HEIGHT, LCD_COLOR_BLACK);
    LCD_DrawLine(traceXPos+traceWidth, traceYPos-1, traceXPos+traceWidth, LCD_HEIGHT, LCD_COLOR_BLACK);
    
    for(TraceMenuItemIndex = 0; TraceMenuItemIndex < TraceMenuItems; TraceMenuItemIndex++)
    {
        if(TraceMenuItemIndex == 0)
            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
        else
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);         
        LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
        if(TraceMenuItemIndex == 0)
        {
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
        }
    }  
    LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);

    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
    LCD_DisplayStringLineColumn(LCD_LINE_0, traceXPos+traceWidth+2, "   Hz", 5);                    
    if(SineFreqTable[SineFreqIndex]/10)
    {
        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_16, ((SineFreqTable[SineFreqIndex]/10)+ 0x30));
        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
    }
    else
    {
        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
    }                
    LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_0*8, 32, 9, LCD_COLOR_BLACK);

    /* create datetime file name */
    Create_Date_Time_Filename(dataLogFileName, ".dat");
    
    /* open file with write permission */
    res = f_open(&DATA_LOG_FIL_Obj, dataLogFileName, FA_CREATE_ALWAYS | FA_WRITE); 
    
