satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Failed", 20);   
    */

    if(res == FR_OK)
        DATA_LOGGING_ENABLED = 1;

    if(DATA_LOGGING_ENABLED)
    {
        /* Write Data_Channel[DATA_CHANNELS] to log file */    
        res = f_write(&DATA_LOG_FIL_Obj, Data_Channel, DATA_CHANNELS, &bytesWritten);
        // res = f_sync(&DATA_LOG_FIL_Obj);
    }            
    
    /* Configure the ADC */
    ADC_DMA_TIM_Configuration(ENABLE);
    ADC_DMA_TIM_ENABLED = 1;

    /* Configure the DAC */
    DAC_DMA_TIM_Configuration(ENABLE);  
    DAC_DMA_TIM_ENABLED = 1;

    TraceMenuItemIndex = 0;
    while(1)
    {        
        /* Check which key is pressed */
        MyKey = Menu_ReadKey();

        /* If "MENU" pushbutton is pressed */
        if(MyKey == MENU)
        {
            break;
        }                  
    
        /* If "UP" pushbutton is pressed */
        if(MyKey == UP)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);
        
            if(TraceMenuItemIndex > 0)
            {
                TraceMenuItemIndex--;
            }
            else
            {
                TraceMenuItemIndex = (TraceMenuItems - 1);
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "DOWN" pushbutton is pressed */
        if(MyKey == DOWN)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);

            if(TraceMenuItemIndex >= (TraceMenuItems - 1))
            {
                TraceMenuItemIndex = 0;
            }
            else
            {
                TraceMenuItemIndex++;
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "SEL" pushbutton is pressed */
        if(MyKey == SEL)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            if(TraceMenuItemIndex == 0)
            {
                if(SineFreqIndex < 5)
                {
                    /* Stop DAC */
                    TIM_Cmd(TIM7, DISABLE);
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);
                    DAC_DMA_TIM_ENABLED = 0;
                
                    SineFreqIndex++;
                    TIM7->ARR = (1000 / SineFreqTable[SineFreqIndex]) - 1; 
                
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                    LCD_DisplayStringLineColumn(LCD_LINE_0, traceXPos+traceWidth+2, "   Hz", 5);                    
                    if(SineFreqTable[SineFreqIndex]/10)
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_16, ((SineFreqTable[SineFreqIndex]/10)+ 0x30));
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }
                    else
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }                
                    LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_0*8, 32, 9, LCD_COLOR_BLACK);
                
                    /* Start DAC */                
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);
                    TIM_Cmd(TIM7, ENABLE);
                    DAC_DMA_TIM_ENABLED = 1;  
                }                
            }        
            else if(TraceMenuItemIndex == 1)
            {
                if(SineFreqIndex > 0)
                {
                    /* Stop DAC */
                    TIM_Cmd(TIM7, DISABLE);
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);
                    DAC_DMA_TIM_ENABLED = 0;
                
                    SineFreqIndex--;
                    TIM7->ARR = (1000 / SineFreqTable[SineFreqIndex]) - 1; 
                
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                    LCD_DisplayStringLineColumn(LCD_LINE_0, traceXPos+traceWidth+2, "   Hz", 5);                    
                    if(SineFreqTable[SineFreqIndex]/10)
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_16, ((SineFreqTable[SineFreqIndex]/10)+ 0x30));
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }
                    else
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }                
                    LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_0*8, 32, 9, LCD_COLOR_BLACK);

                    /* Start DAC */                
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);
                    TIM_Cmd(TIM7, ENABLE);
                    DAC_DMA_TIM_ENABLED = 1;  
                }                
            }        
            else if(TraceMenuItemIndex == 2)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(DAC_DMA_TIM_ENABLED || ADC_DMA_TIM_ENABLED)
                {                     
                    /* Stop DAC */
                    TIM_Cmd(TIM7, DISABLE);
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);

                    /* Stop ADC */
                    TIM_Cmd(TIM3, DISABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PLAY ",5);
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    DAC_DMA_TIM_ENABLED = 0;
                    ADC_DMA_TIM_ENABLED = 0;                
                }
                else
                {
                    /* Start ADC */
                    TIM_Cmd(TIM3, ENABLE);
                
                    /* Start DAC */                
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);
                    TIM_Cmd(TIM7, ENABLE);
                                   
                    strncpy(TraceMenu[TraceMenuItemIndex],"PAUSE",5); 
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
                
                    ADC_DMA_TIM_ENABLED = 1;
                    DAC_DMA_TIM_ENABLED = 1;                                    
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 3)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(FILTER_ENABLED)
                {                
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIRON",5);                
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 0;                               
                }
                else
                {
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIROF",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 1;                  
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 4)
            {
                break;
            }       
        
