satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
    /* close the file, writes cached content to disk */
    res = f_close(&DATA_LOG_FIL_Obj);
        
    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Close File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Close File : Failed", 20); 
    */

#ifdef QRS_DETECT_LED_OUT     
    /* Turn off LED2 */
    GPIO_SetBits(GPIO_LED, GPIO_LED2_PIN);
#endif
#ifdef QRS_DETECT_BUZZER_OUT     
    /* Turn off Buzzer */
    GPIO_SetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
#endif

    /* Display Main Menu */
    Menu_ReturnMainMenu();
    // /* Clear the LCD */
    // LCD_Clear(LCD_COLOR_WHITE);
    // /* Display the menu */
    // Menu_DisplayMenu();
    /* Enable the JoyStick interrupts */
    IntExtOnOffConfig(ENABLE);
}

void Play_Log_File(uint8_t *logFile)
{
    char TraceMenu[5][6] = {"PAUSE","IIROF","MULx2","DEL  ","EXIT "};
    int TraceMenuItems = 5, TraceMenuItemIndex = 0, MyKey = 0, ReStart = 0;
  
    xv[0] = xv[1] = xv[2] = xv[3] = xv[4] = 0;
    yv[0] = yv[1] = yv[2] = yv[3] = yv[4] = 0;

    xv_qrs[0] = xv_qrs[1] = xv_qrs[2] = xv_qrs[3] = xv_qrs[4] = 0;
    yv_qrs[0] = yv_qrs[1] = yv_qrs[2] = yv_qrs[3] = yv_qrs[4] = 0;

/*
    xv_bp1[0] = xv_bp1[1] = xv_bp1[2] = 0;
    yv_bp1[0] = yv_bp1[1] = yv_bp1[2] = 0;
    xv_bp2[0] = xv_bp2[1] = xv_bp2[2] = 0;
    yv_bp2[0] = yv_bp2[1] = yv_bp2[2] = 0;
    xv_bp3[0] = xv_bp3[1] = xv_bp3[2] = 0;
    yv_bp3[0] = yv_bp3[1] = yv_bp3[2] = 0;
    xv_bp4[0] = xv_bp4[1] = xv_bp4[2] = 0;
    yv_bp4[0] = yv_bp4[1] = yv_bp4[2] = 0;
    xv_bp5[0] = xv_bp5[1] = xv_bp5[2] = 0;
    yv_bp5[0] = yv_bp5[1] = yv_bp5[2] = 0;
    xv_bp6[0] = xv_bp6[1] = xv_bp6[2] = 0;
    yv_bp6[0] = yv_bp6[1] = yv_bp6[2] = 0;
*/

    /* Clear the LCD */
    LCD_Clear(LCD_COLOR_WHITE);

    LCD_DrawRect(traceXPos-1, traceYPos-1, LCD_WIDTH, LCD_HEIGHT, LCD_COLOR_BLACK);
    LCD_DrawLine(traceXPos+traceWidth, traceYPos-1, traceXPos+traceWidth, LCD_HEIGHT, LCD_COLOR_BLACK);
    
    for(TraceMenuItemIndex = 0; TraceMenuItemIndex < TraceMenuItems; TraceMenuItemIndex++)
    {
        if(TraceMenuItemIndex == 0)
            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
        else
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);         
        LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
        if(TraceMenuItemIndex == 0)
        {
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
        }
    }  
    LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);

    /* open file with read permission */
    res = f_open(&DATA_LOG_FIL_Obj, logFile, FA_OPEN_EXISTING | FA_READ); 
    
    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, logFile, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Failed", 20);   
    */

    /* Read Data_Channel[DATA_CHANNELS] from file */
    res = f_read(&DATA_LOG_FIL_Obj, Data_Channel, DATA_CHANNELS, &bytesRead);

    if(Data_Channel[0] == VBAT_AIN_CHANNEL)
    {
        Data_Channel_Trace_Enabled[0] = 0;
        Data_Channel_Filter_Enabled[0] = 0;
        prevData[0] = 0;
    }

    if(Data_Channel[DATA_CHANNELS - 1] != VBAT_AIN_CHANNEL)
    {
        Data_Channel_Trace_Enabled[DATA_CHANNELS - 1] = 1;
        Data_Channel_Filter_Enabled[DATA_CHANNELS - 1] = 1;
        prevData[DATA_CHANNELS - 1] = traceYPos + traceHeight/2;
    }

    traceOffset = traceXPos;

    if(Data_Channel[DATA_CHANNELS - 1] == ECG_AIN_CHANNEL)
    {
#ifdef USE_DAC_IA_REF  
        filter_type = 2;
        scale_factor = 100;
#else
        filter_type = 1;
        scale_factor = 1;
#endif

    }
    else
    {
        filter_type = 1;
        scale_factor = 1;    
    }

#ifdef USE_ADC_OVERSAMPLING
    filter_offset = 16384;
#else
    filter_offset = 2048;
#endif

    /* Feature Flags */
    DRAW_LCD_TRACE_ENABLED = 1;
    MEM_DMA_TIM_ENABLED = 0;
    FILTER_ENABLED = 1;

    if(Data_Channel[DATA_CHANNELS - 1] == ECG_AIN_CHANNEL)
    {
        DETECT_DISPLAY_HR_ENABLED = 1;
        QRS_Detect = 0;
        QRS_Interval = 0;
        Heart_Rate = 0;
    }

    /* Read a chunk of file */
    res = f_read(&DATA_LOG_FIL_Obj, &DATA_LOG_Read_Buff[0], DMA_DATA_BUFF_SIZE, &dataLogBytesReadHT);
    
    /* Read a chunk of file */
    res = f_read(&DATA_LOG_FIL_Obj, &DATA_LOG_Read_Buff[DATA_BUFF_SIZE], DMA_DATA_BUFF_SIZE, &dataLogBytesReadTC);
        
    MEM_DMA_TIM_Configuration(ENABLE);
    MEM_DMA_TIM_ENABLED = 1;
   
    TraceMenuItemIndex = 0;
    while(1)
    {        
        /* Check which key is pressed */
        MyKey = Menu_ReadKey();

        /* If "MENU" pushbutton is pressed */
        if(MyKey == MENU)
        {
            break;
        }                  
    
        /* If "UP" pushbutton is pressed */
        if(MyKey == UP)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);

            if(TraceMenuItemIndex > 0)
            {
                TraceMenuItemIndex--;
            }
            else
            {
                TraceMenuItemIndex = (TraceMenuItems - 1);
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
