satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
            /* Read Data_Channel[DATA_CHANNELS] from file */
            res = f_read(&DATA_LOG_FIL_Obj, Data_Channel, DATA_CHANNELS, &bytesRead);

            if(Data_Channel[0] == VBAT_AIN_CHANNEL)
            {
                Data_Channel_Trace_Enabled[0] = 0;
                Data_Channel_Filter_Enabled[0] = 0;
                prevData[0] = 0;
            }

            if(Data_Channel[DATA_CHANNELS - 1] != VBAT_AIN_CHANNEL)
            {
                Data_Channel_Trace_Enabled[DATA_CHANNELS - 1] = 1;
                Data_Channel_Filter_Enabled[DATA_CHANNELS - 1] = 1;
                prevData[DATA_CHANNELS - 1] = traceYPos + traceHeight/2;
            }

            traceOffset = traceXPos;

            /* Read a chunk of file */
            f_read(&DATA_LOG_FIL_Obj, &DATA_LOG_Read_Buff[0], DMA_DATA_BUFF_SIZE, &dataLogBytesReadHT);
            /* Read a chunk of file */
            f_read(&DATA_LOG_FIL_Obj, &DATA_LOG_Read_Buff[DATA_BUFF_SIZE], DMA_DATA_BUFF_SIZE, &dataLogBytesReadTC);        

            MEM_DMA_TIM_ENABLED = 0;  
            ReStart = 1;        
        }   
    }

    MEM_DMA_TIM_Configuration(DISABLE);

    /* close the file, writes cached content to disk */
    res = f_close(&DATA_LOG_FIL_Obj);

    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, logFile, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Close File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Close File : Failed", 20); 
    */

#ifdef QRS_DETECT_LED_OUT     
    /* Turn off LED2 */
    GPIO_SetBits(GPIO_LED, GPIO_LED2_PIN);
#endif
#ifdef QRS_DETECT_BUZZER_OUT     
    /* Turn off Buzzer */
    GPIO_SetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
#endif
}

void Browse_Log_Files(void)
{
    FRESULT res;
    FILINFO fno;
    DIR dir;
    char *fn;
#if _USE_LFN
    char logfiles[MAX_FILES][_MAX_LFN - 1];
#endif
    int TotalFiles = 0, TotalPages = 0, FileIndex = 0, PageIndex = 0;
    int FileItemIndex = 0, SelectedFileItemIndex = 0, MaxFileItemIndex = MAX_FILES - 1;
    int FetchPreviousPage = 0, FetchNextPage = 1, MyKey = 0;
#if _USE_LFN
    static char lfn[_MAX_LFN * (/*_DF1S*/0 ? 2 : 1) + 1];
    fno.lfname = lfn;
    fno.lfsize = sizeof(lfn);
#endif

    IntExtOnOffConfig(DISABLE);

    res = f_opendir(&dir, "/");
    if (res == FR_OK) {  
        for(;;)
        {
            res = f_readdir(&dir, &fno);
            if (res != FR_OK || fno.fname[0] == 0)
            {
                f_readdir(&dir, 0);
                break;
            }
#if _USE_LFN
            fn = *fno.lfname ? fno.lfname : fno.fname;
            /* memcpy(logfiles[0],fn,_MAX_LFN - 1); */
            strncpy(logfiles[0],fn,_MAX_LFN - 1);
            if((logfiles[0][_MAX_LFN - 6] != '.')
            || (logfiles[0][_MAX_LFN - 5] != 'd')
            || (logfiles[0][_MAX_LFN - 4] != 'a')
            || (logfiles[0][_MAX_LFN - 3] != 't')
            || (logfiles[0][_MAX_LFN - 2] != '\0')) continue;
#else
            fn = fno.fname;
#endif        
            TotalFiles++;
        }
    
        for(;;)
        {
            /* Clear the LCD */
            LCD_Clear(LCD_COLOR_WHITE);       
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
        
            if(!TotalFiles)
            {
                LCD_DisplayStringLine(LCD_LINE_3, "    No Data Files   ");
                LCD_DisplayStringLine(LCD_LINE_4, " To exit press a key");
                
                while (Menu_ReadKey() == NOKEY)
                {
                }
                
                Menu_ReturnMainMenu();
                // /* Clear the LCD */
                // LCD_Clear(LCD_COLOR_WHITE);
                // /* Display the menu */
                // Menu_DisplayMenu();
                /* Enable the JoyStick interrupts */
                IntExtOnOffConfig(ENABLE);
                return;            
            }
        
            LCD_DisplayStringLine(LCD_LINE_0, "  Play Signal File  ");
                              
            if(FetchPreviousPage)
            {            
                FileItemIndex = FileIndex;           
                while(FileItemIndex)
                {
                    f_readdir(&dir, &fno);
#if _USE_LFN
                    fn = *fno.lfname ? fno.lfname : fno.fname;
                    /* memcpy(logfiles[0],fn,_MAX_LFN - 1); */
                    strncpy(logfiles[0],fn,_MAX_LFN - 1);
                    if((logfiles[0][_MAX_LFN - 6] != '.')
                    || (logfiles[0][_MAX_LFN - 5] != 'd')
                    || (logfiles[0][_MAX_LFN - 4] != 'a')
                    || (logfiles[0][_MAX_LFN - 3] != 't')
                    || (logfiles[0][_MAX_LFN - 2] != '\0')) continue;
#else
                    fn = fno.fname;
#endif        
                    FileItemIndex--;
                }
                FetchNextPage = 1;            
            }
   
            FileItemIndex = 0;
        
            while(1)
            {            
                if(FetchNextPage)
                {
                    res = f_readdir(&dir, &fno);
                    if (res != FR_OK || fno.fname[0] == 0)
                    {
                        MaxFileItemIndex = FileItemIndex - 1;
                        FileItemIndex = SelectedFileItemIndex;                    
                        break;
                    }
                    /* if (fno.fname[0] == '.') continue; */
#if _USE_LFN
                    fn = *fno.lfname ? fno.lfname : fno.fname;
                    /* memcpy(logfiles[FileItemIndex],fn,_MAX_LFN - 1); */
                    strncpy(logfiles[FileItemIndex],fn,_MAX_LFN - 1);
                    if((logfiles[FileItemIndex][_MAX_LFN - 6] != '.')
                    || (logfiles[FileItemIndex][_MAX_LFN - 5] != 'd')
                    || (logfiles[FileItemIndex][_MAX_LFN - 4] != 'a')
                    || (logfiles[FileItemIndex][_MAX_LFN - 3] != 't')
                    || (logfiles[FileItemIndex][_MAX_LFN - 2] != '\0')) continue;
#else
                    fn = fno.fname;
                    /* memcpy(logfiles[FileItemIndex],fn,13); */
                    strncpy(logfiles[FileItemIndex],fn,13);
#endif   
                    FileIndex++;            
                }
 
                if(FileItemIndex == SelectedFileItemIndex)
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                else
                    LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);               
                LCD_DisplayStringLine(6-FileItemIndex, logfiles[FileItemIndex]);                
                if(FileItemIndex == SelectedFileItemIndex)
                {
                    LCD_DrawRect(LCD_COLUMN_0-1, (6-FileItemIndex)*8, 121, 9, LCD_COLOR_BLACK);
                }
                
                FileItemIndex++;            
            
                if(FileItemIndex > MaxFileItemIndex)
                {
                    FileItemIndex = SelectedFileItemIndex;
                    break;
                }
            }
            
            TotalPages = ((TotalFiles + MAX_FILES - 1) / MAX_FILES);
            PageIndex = ((FileIndex + MAX_FILES - 1) / MAX_FILES);
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLine(LCD_LINE_7, "Files:000 Page:00/00");      
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_6, ((TotalFiles / 100) + 0x30));
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_7, (((TotalFiles % 100) / 10) + 0x30));
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_8, (((TotalFiles % 100) % 10) + 0x30));
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_15, ((PageIndex / 10) + 0x30));
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_16, ((PageIndex % 10) + 0x30));
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_18, ((TotalPages / 10) + 0x30));
            LCD_DisplayChar(LCD_LINE_7, LCD_COLUMN_19, ((TotalPages % 10) + 0x30));

            while(1)
            {
                /* Check which key is pressed */
                MyKey = Menu_ReadKey();

                /* If "MENU" pushbutton is pressed */
                if(MyKey == MENU)
                {
                    Menu_ReturnMainMenu();
                    // /* Clear the LCD */
                    // LCD_Clear(LCD_COLOR_WHITE);
                    // /* Display the menu */
                    // Menu_DisplayMenu();
                    /* Enable the JoyStick interrupts */
                    IntExtOnOffConfig(ENABLE);
                    return;
                }                  
            
                /* If "UP" pushbutton is pressed */
                if(MyKey == UP)
                {
                    LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
                    LCD_DisplayStringLine(6-FileItemIndex, logfiles[FileItemIndex]);    
                    LCD_DrawRect(LCD_COLUMN_0-1, (6-FileItemIndex)*8, 121, 9, LCD_COLOR_WHITE);
                
