satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
                    if(FileItemIndex > 0)
                    {
                        FileItemIndex--;
                    }
                    else
                    {
                        FetchPreviousPage = 1;
                        FetchNextPage = 0;
                        f_readdir(&dir, 0);
                        if(PageIndex > 1)
                        {                         
                            FileIndex = (PageIndex - 2) * MAX_FILES;
                            MaxFileItemIndex = MAX_FILES - 1;
                        }
                        else
                        {  
                            FileIndex = (TotalPages - 1) * MAX_FILES;
                            MaxFileItemIndex = TotalFiles - FileIndex - 1;
                        }
                        SelectedFileItemIndex = MaxFileItemIndex;
                        break;
                    }
      
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                    LCD_DisplayStringLine(6-FileItemIndex, logfiles[FileItemIndex]);    
                    LCD_DrawRect(LCD_COLUMN_0-1, (6-FileItemIndex)*8, 121, 9, LCD_COLOR_BLACK);               
                }

                /* If "DOWN" pushbutton is pressed */
                if(MyKey == DOWN)
                {
                    LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
                    LCD_DisplayStringLine(6-FileItemIndex, logfiles[FileItemIndex]);    
                    LCD_DrawRect(LCD_COLUMN_0-1, (6-FileItemIndex)*8, 121, 9, LCD_COLOR_WHITE);

                    if(FileItemIndex >= MaxFileItemIndex)
                    {
                        FetchPreviousPage = 0;
                        FetchNextPage = 1;
                        MaxFileItemIndex = MAX_FILES - 1;
                        SelectedFileItemIndex = 0;
                        if(PageIndex == TotalPages)
                        {
                            f_readdir(&dir, 0);
                            FileIndex = 0;
                        }
                        break;                    
                    }
                    else
                    {
                        FileItemIndex++;
                    }
      
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                    LCD_DisplayStringLine(6-FileItemIndex, logfiles[FileItemIndex]);    
                    LCD_DrawRect(LCD_COLUMN_0-1, (6-FileItemIndex)*8, 121, 9, LCD_COLOR_BLACK);               
                }
            
                /* If "SEL" pushbutton is pressed */
                if(MyKey == SEL)
                {
                    if((logfiles[FileItemIndex][_MAX_LFN - 6] == '.')
                    && (logfiles[FileItemIndex][_MAX_LFN - 5] == 'd')
                    && (logfiles[FileItemIndex][_MAX_LFN - 4] == 'a')
                    && (logfiles[FileItemIndex][_MAX_LFN - 3] == 't')
                    && (logfiles[FileItemIndex][_MAX_LFN - 2] == '\0'))
                    {
                        Play_Log_File(logfiles[FileItemIndex]);
                    }
                    if((logfiles[FileItemIndex][_MAX_LFN - 6] != '.')
                    || (logfiles[FileItemIndex][_MAX_LFN - 5] != 'd')
                    || (logfiles[FileItemIndex][_MAX_LFN - 4] != 'a')
                    || (logfiles[FileItemIndex][_MAX_LFN - 3] != 't')
                    || (logfiles[FileItemIndex][_MAX_LFN - 2] != '\0'))
                    {
                        TotalFiles--;
                        FileIndex--;
                        TotalPages = ((TotalFiles + MAX_FILES - 1) / MAX_FILES);
                        PageIndex = ((FileIndex + MAX_FILES - 1) / MAX_FILES);
                    
                        FetchPreviousPage = 1;
                        FetchNextPage = 0;
                        f_readdir(&dir, 0);
                        FileIndex = (PageIndex - 1) * MAX_FILES;
                        MaxFileItemIndex = TotalFiles - FileIndex - 1;
                        SelectedFileItemIndex = FileItemIndex;
                        if(PageIndex == TotalPages)
                        {
                            if((SelectedFileItemIndex > MaxFileItemIndex) || (MaxFileItemIndex == (MAX_FILES - 1)))
                            {
                                FileIndex = 0;
                                SelectedFileItemIndex = 0;
                            }
                        }
                        MaxFileItemIndex = MAX_FILES - 1;
                    }
                    else
                    {
                        FetchPreviousPage = 0;
                        FetchNextPage = 0;
                        SelectedFileItemIndex = FileItemIndex;
                    }
                    break;                    
                }   
            }
        }
    }
    else
    {
        /* Clear the LCD */
        LCD_Clear(LCD_COLOR_WHITE);       
        LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
        LCD_DisplayStringLine(LCD_LINE_6, "SDCard Not Found.   ");    
        LCD_DisplayStringLine(LCD_LINE_7, "Press a key to Exit.");
    
        while(Menu_ReadKey() == NOKEY)
        {
        }

        LCD_Clear(LCD_COLOR_WHITE);
        Menu_DisplayMenu();
        IntExtOnOffConfig(ENABLE);
    }
}

void Delete_All_Log_Files(void)
{
    FRESULT res;
    FILINFO fno;
    DIR dir;
    char *fn;
#if _USE_LFN
    char logfile[_MAX_LFN - 1];
#endif
#if _USE_LFN
    static char lfn[_MAX_LFN * (/*_DF1S*/0 ? 2 : 1) + 1];
    fno.lfname = lfn;
    fno.lfsize = sizeof(lfn);
#endif

    uint32_t pressedkey = 0;

    LCD_Clear(LCD_COLOR_WHITE);
    IntExtOnOffConfig(DISABLE);

    res = f_opendir(&dir, "/");
    if (res == FR_OK) {
        LCD_DisplayStringLine(LCD_LINE_6, "Press OK to continue");
        LCD_DisplayStringLine(LCD_LINE_7, "else any key to Exit");

        while (1)
        {
            pressedkey = Menu_ReadKey();
            if (pressedkey == SEL)
            {
                break;
            }
            else if (pressedkey != NOKEY)
            {
                LCD_Clear(LCD_COLOR_WHITE);
                Menu_DisplayMenu();
                IntExtOnOffConfig(ENABLE);     
                return;
            }
        }
    
        LCD_ClearLine(LCD_LINE_6);
        LCD_DisplayStringLine(LCD_LINE_7, "Deleting Log Files..");

        for(;;)
        {
            res = f_readdir(&dir, &fno);
            if (res != FR_OK || fno.fname[0] == 0) break;
            /* if (fno.fname[0] == '.') continue; */
#if _USE_LFN
            fn = *fno.lfname ? fno.lfname : fno.fname;
            strncpy(logfile,fn,_MAX_LFN - 1);
            if((logfile[_MAX_LFN - 6] != '.')
            || (logfile[_MAX_LFN - 5] != 'd')
            || (logfile[_MAX_LFN - 4] != 'a')
            || (logfile[_MAX_LFN - 3] != 't')
            || (logfile[_MAX_LFN - 2] != '\0')) continue;            
#else
            fn = fno.fname;
            strncpy(logfile,fn,13);
#endif                        
            f_unlink(logfile);
        }
    
        LCD_DisplayStringLine(LCD_LINE_6, " Log Files Deleted  ");
        LCD_DisplayStringLine(LCD_LINE_7, "Press a key to Exit.");
    }
    else
    {
        LCD_DisplayStringLine(LCD_LINE_6, "SDCard Not Found.   ");    
        LCD_DisplayStringLine(LCD_LINE_7, "Press a key to Exit.");
    }

    while(Menu_ReadKey() == NOKEY)
    {
    }

    LCD_Clear(LCD_COLOR_WHITE);
    Menu_DisplayMenu();
    IntExtOnOffConfig(ENABLE);
}

