satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Alpha/src/hw_config.c
    /* Display Battery Voltage Graphics here */

    ADC_Configuration(DISABLE);

    while (Menu_ReadKey() == NOKEY)
    {
    }

    LCD_Clear(LCD_COLOR_WHITE);
    Menu_DisplayMenu();
    IntExtOnOffConfig(ENABLE);
}

void Set_LCD_BackLight_Time(void)
{
#ifdef REGULATOR_FAULT
    /* Low Battery - Regulator fault detect */
    Regulator_Fault();
#endif

    if(!REGULATOR_FAULT_DETECTED)
        LCD_SetBackLight(LCD_BRIGHTNESS_NIL);
    else
        LCD_SetBackLight(LCD_BRIGHTNESS_HIGH);

    LCD_BackLight_RTC_Counter = RTC_GetCounter() + LCD_BACKLIGHT_TIME;

    if (LCD_BackLight_RTC_Counter / 86399 != 0)
    {
        LCD_BackLight_RTC_Counter = LCD_BACKLIGHT_TIME;
    }
}

#ifdef USE_IWDG 
void Set_IWDG_ReloadCounter_Time(void)
{
    IWDG_ReloadCounter();

    IWDG_ReloadCounter_RTC_Counter = RTC_GetCounter() + IWDG_RELOADCOUNTER_TIME;

    if (IWDG_ReloadCounter_RTC_Counter / 86399 != 0)
    {
        IWDG_ReloadCounter_RTC_Counter = IWDG_RELOADCOUNTER_TIME;
    }
}
#endif

void Set_LowPower_StopMode_Time(void)
{
    LOW_POWER_STOP_MODE = 0;

    LowPower_StopMode_RTC_Counter = RTC_GetCounter() + LOWPOWER_STOPMODE_TIME;

    if (LowPower_StopMode_RTC_Counter / 86399 != 0)
    {
        LowPower_StopMode_RTC_Counter = LOWPOWER_STOPMODE_TIME;
    }
}

/**
  * @brief  Enters MCU in STOP mode. The wake-up from STOP mode is performed by 
  *         an external interrupt or RTC Alarm.
  * @param  None
  * @retval None
  */
void LowPower_EnterSTOPMode_EXTI_RTCAlarm(void)
{
    STOPMODE_SYSTEM_SHUTDOWN = 0;

    System_Shutdown_RTC_Counter = RTC_GetCounter() + SYSTEM_SHUTDOWN_TIME;

    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();

    if (System_Shutdown_RTC_Counter / 86399 != 0)
    {
        System_Shutdown_RTC_Counter = SYSTEM_SHUTDOWN_TIME;
    }

    /* Set RTC Alarm register with the new value */
    RTC_SetAlarm(System_Shutdown_RTC_Counter);

    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask(); 

#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif

    // LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_18, "LP", 2);

    /* Clear the RTC Alarm flag */
    RTC_ClearFlag(RTC_FLAG_ALR);

    /* Request to enter STOP mode with regulator in low power */
    PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);

    /* Configures system clock after wake-up from STOP: enable HSE, PLL and select PLL
    as system clock source (HSE and PLL are disabled in STOP mode) */
    LowPower_SYSCLKConfig_STOP();

    // LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_18, "  ", 2);
    
#ifdef USE_USB_HID
    USB_Cable_Config(ENABLE);
#endif    

    if (STOPMODE_SYSTEM_SHUTDOWN)
    {
        System_Shutdown();
    }
}


